In [34]:
pip show pandas

Name: pandas
Version: 2.2.2
Summary: Powerful data structures for data analysis, time series, and statistics
Home-page: https://pandas.pydata.org
Author:
Author-email: The Pandas Development Team <pandas-dev@python.org>
License: BSD 3-Clause License

Copyright (c) 2008-2011, AQR Capital Management, LLC, Lambda Foundry, Inc. and PyData Development Team
All rights reserved.

Copyright (c) 2011-2023, Open source contributors.

Redistribution and use in source and binary forms, with or without
modification, are permitted provided that the following conditions are met:

* Redistributions of source code must retain the above copyright notice, this
  list of conditions and the following disclaimer.

* Redistributions in binary form must reproduce the above copyright notice,
  this list of conditions and the following disclaimer in the documentation
  and/or other materials provided with the distribution.

* Neither the name of the copyright holder nor the names of its
  contributors may be used to endorse or promote products derived from
  this software without specific prior written permission.

THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
Location: c:\Users\abhij\miniconda3\Lib\site-packages
Requires: numpy, python-dateutil, pytz, tzdata
Required-by: seaborn
Note: you may need to restart the kernel to use updated packages.

pandas for analysis
- datasets
    - dictionary of items
    - list of dictionary
    - csv file
    - excel file
    - json file
    - sql connection
- creating dataframe
- reading data
- Selectiong data
- manipulating data
- cleaning data
- visualizing data

In [35]:
import pandas as pd

In [36]:
books = {
    'title': ['The art of war', 'The final empire'],
    'author': ['Sun tzu', 'Brandon Sanderson'],
    'Price': [399, 1099],
}
pd.DataFrame(books)

              title             author  Price
0    The art of war            Sun tzu    399
1  The final empire  Brandon Sanderson   1099

In [37]:
books1 = {
    'title': ['Maths', 'Physics'],
    'author': ['RS agarwal', 'Newton'],
    'Price': [1100,999],
}
pd.DataFrame(books1)

     title      author  Price
0    Maths  RS agarwal   1100
1  Physics      Newton    999

In [38]:
movies = [
    {'tittle':"PK", 'director':"rajkumar Hirani", 'year':2014},
    {'tittle': "I", 'director':"Shankar",'year':2015},
]
pd.DataFrame(movies)

  tittle         director  year
0     PK  rajkumar Hirani  2014
1      I          Shankar  2015

In [39]:
pd.read_csv('dummy.csv')

   id  product  price
0   1    apple    100
1   2  bannana     50
2   3   cherry     20

In [40]:
pd.read_json('dummy.json')

       name  age             email
0  john Doe   25  johnny@gmail.com

In [41]:
pd.read_excel(r'C:\Users\abhij\Downloads\dummydata.csv.xlsx')

   S.no   Name  College
0     1  Akash    Amity
1     2   Ajay  Shardha
2     3  Abhay    Amity

In [42]:
url = 'https://raw.githubusercontent.com/digipodium/Datasets/main/regression/kc_house_data.csv' 
df = pd.read_csv(url)
df

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
0,7129300520,20141013T000000,221900.0,3,1.00,1180,5650,1.0,0,0,...,7,1180,0,1955,0,98178,47.5112,-122.257,1340,5650
1,6414100192,20141209T000000,538000.0,3,2.25,2570,7242,2.0,0,0,...,7,2170,400,1951,1991,98125,47.7210,-122.319,1690,7639
2,5631500400,20150225T000000,180000.0,2,1.00,770,10000,1.0,0,0,...,6,770,0,1933,0,98028,47.7379,-122.233,2720,8062
3,2487200875,20141209T000000,604000.0,4,3.00,1960,5000,1.0,0,0,...,7,1050,910,1965,0,98136,47.5208,-122.393,1360,5000
4,1954400510,20150218T000000,510000.0,3,2.00,1680,8080,1.0,0,0,...,8,1680,0,1987,0,98074,47.6168,-122.045,1800,7503
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
21608,263000018,20140521T000000,360000.0,3,2.50,1530,1131,3.0,0,0,...,8,1530,0,2009,0,98103,47.6993,-122.346,1530,1509
21609,6600060120,20150223T000000,400000.0,4,2.50,2310,5813,2.0,0,0,...,8,2310,0,2014,0,98146,47.5107,-122.362,1830,7200
21610,1523300141,20140623T000000,402101.0,2,0.75,1020,1350,2.0,0,0,...,7,1020,0,2009,0,98144,47.5944,-122.299,1020,2007
21611,291310100,20150116T000000,400000.0,3,2.50,1600,2388,2.0,0,0,...,8,1600,0,2004,0,98027,47.5345,-122.069,1410,1287
21612,1523300157,20141015T000000,325000.0,2,0.75,1020,1076,2.0,0,0,...,7,1020,0,2008,0,98144,47.5941,-122.299,1020,1357

First step after reading the data 
- 'df.head(nrows)' - first n rows
- 'df.tail(nrows)' - last n rows
- df.info()-  data types, missing value
- df.describe() - summary statistics
- df.shape()
- df.columns()

In [43]:
df.head(2)

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
0,7129300520,20141013T000000,221900.0,3,1.00,1180,5650,1.0,0,0,...,7,1180,0,1955,0,98178,47.5112,-122.257,1340,5650
1,6414100192,20141209T000000,538000.0,3,2.25,2570,7242,2.0,0,0,...,7,2170,400,1951,1991,98125,47.7210,-122.319,1690,7639

In [44]:
df.tail(3)

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
21610,1523300141,20140623T000000,402101.0,2,0.75,1020,1350,2.0,0,0,...,7,1020,0,2009,0,98144,47.5944,-122.299,1020,2007
21611,291310100,20150116T000000,400000.0,3,2.50,1600,2388,2.0,0,0,...,8,1600,0,2004,0,98027,47.5345,-122.069,1410,1287
21612,1523300157,20141015T000000,325000.0,2,0.75,1020,1076,2.0,0,0,...,7,1020,0,2008,0,98144,47.5941,-122.299,1020,1357

In [45]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21613 entries, 0 to 21612
Data columns (total 21 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id             21613 non-null  int64
 1   date           21613 non-null  object
 2   price          21613 non-null  float64
 3   bedrooms       21613 non-null  int64
 4   bathrooms      21613 non-null  float64
 5   sqft_living    21613 non-null  int64
 6   sqft_lot       21613 non-null  int64
 7   floors         21613 non-null  float64
 8   waterfront     21613 non-null  int64
 9   view           21613 non-null  int64
 10  condition      21613 non-null  int64
 11  grade          21613 non-null  int64
 12  sqft_above     21613 non-null  int64
 13  sqft_basement  21613 non-null  int64
 14  yr_built       21613 non-null  int64
 15  yr_renovated   21613 non-null  int64
 16  zipcode        21613 non-null  int64
 17  lat            21613 non-null  float64
 18  long           21613 non-null  float64
 19  sqft_living15  21613 non-null  int64
 20  sqft_lot15     21613 non-null  int64
dtypes: float64(5), int64(15), object(1)
memory usage: 3.5+ MB

In [46]:
df.sample(3)

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
11835,5499200060,20150403T000000,635000.0,4,3.0,2100,3800,2.0,0,0,...,8,2100,0,1972,0,98115,47.6807,-122.291,1320,3800
3602,6132600315,20140827T000000,375000.0,1,1.0,1090,5250,1.0,0,0,...,6,980,110,1927,0,98117,47.6999,-122.391,2160,5250
7198,792500190,20140627T000000,410000.0,3,2.0,1400,45738,2.0,0,0,...,8,1400,0,1981,0,98070,47.3624,-122.455,2390,56628

In [47]:
df.describe(include='objects') # summary statistics for object column

TypeError: data type 'objects' not understood

In [ ]:
df.shape

In [ ]:
df.columns

In [ ]:
print(df.columns.tolist())

In [ ]:
# Simple Sort
df.sort_values('bedrooms')

In [ ]:
# Style the dataframe to highlight
df.style.highlight_max(color='lightgreen')

# Selecting data in pandas
- dataframe
    - rows
        - iloc- index based location
        - loc - label based location
    - Columns
        - single columns selection
        - multiple column selection
        - columns selection by data type
    - conditional selection
        - boolean indexing
        - query method

In [ ]:
# Selecting rows form iloc
df.iloc[100] # idx 100 row

In [ ]:
# randoms 5 rows
df.iloc[[1,59,100,200,300]] # idx [ 1, 59, 100, 200, 300] rows

In [ ]:
# randoms 5 rows , with selected columns
df.iloc[[1,10,20], [0,11,12,3,4]]

In [ ]:
df.iloc[15:50, :10] # idx 15-49 rows, 0-9 columns

In [ ]:
# selecting columns based on indexes 
df.iloc[:,[0,5,10,11]]

In [ ]:
# updating indexes columns
df = df.set_index('id')
df.head()

In [ ]:
df

In [ ]:
df.loc[[7129300520, 1523300157]]

## columns selection
- dictionary like selection
    - dataframe['columns_name']
- objects like selection
    - dataframe.columns_name

Multiple Columns Selection
- dictionary like selection
    - dataframe[list_of_columns]

In [ ]:
df['price']

In [ ]:
df.bedrooms

In [ ]:
df[['bedrooms', 'price','sqft_living']]

In [ ]:
col_list = ['grade', 'condition', 'yr_built']
df[col_list]

## Boolean Indexing
- df['column'] > value
- df['column'] == value
- df['culumn'] != value

In [ ]:
df[df['price'] > 1000000]

In [ ]:
df[df['condition'] >= 5 ]

In [ ]:
df[df['condition'] <= 1 ]

In [ ]:
# 5 star rated house + 2floor
df[(df['condition']==5) & (df['floors'] == 2)]

In [ ]:
f1 = df['price'] > 1000000
f2 = df['condition'] == 5
f3 = df['floors'] == 2
df[f1 & f2 & f3 ]

In [ ]:
df[f1 & f2 & f3].reset_index().style.highlight_max(color='blue')

In [ ]:
df[f1 & f2 & f3].reset_index().style.background_gradient(cmap='GnBu')

In [ ]:
# query
df.query('price > 2500000 & condition == 5')

### Manipulation and cleanining Data
- removing columns
- renaming columns
- adding columns
- changing data types
- handling missing values
- dropping missing values
- using apply() method

In [ ]:
df.columns

In [ ]:
cols_to_drop = ['sqft_living15', 'sqft_lot15']
df = df.drop(columns= cols_to_drop)
df

In [ ]:
df.drop_duplicates(subset=['floors']) #always use a subset  columns

In [ ]:
df.dropna() # remove rows with any null value

In [ ]:
## Renaming columns

name_updated = {
    'lat': 'latitude',
    'long': 'longitude',
}
df.rename(columns=name_updated)

In [ ]:
df

In [ ]:
# Dummy columns
df['dummy'] = "house price" # Repeats same value in all rows
df

In [ ]:
df['age'] = 2024 - df['yr_built'] #add a new columns
df

In [ ]:
### rearraing the columns - first copy the columns
print(df.columns.tolist())

In [ ]:
## Paste the list and reaarange columns as per your choice
columns_sequence = [ 'dummy', 'date', 'bedrooms', 'bathrooms', 'floors', 'waterfront', 'view', 'sqft_living', 'sqft_lot', 
                    'sqft_above', 'sqft_basement', 'yr_built', 'yr_renovated', 'age', 'condition', 'grade', 'zipcode', 'lat', 'long', 'price']
df = df[columns_sequence]
df.head()

In [ ]:
pip install pandas openpyxl plotly seaborn jinja2

In [ ]:
from datetime import datetime
datestr = '20141013T000000'
date = datetime.strptime(datestr, '%Y%m%dT%H%M%S') # Str, format
print(date, type(date))

In [ ]:
datestr = '10-01-2014 12:00'
format = '%d-%m-%Y %H:%M'
print(datetime.strptime(datestr, format))

In [ ]:
# testing and operation 
df.date.apply

Immigration data anlaysis

In [ ]:
cnd = pd.read_excel('Canada.xlsx', sheet_name=1, skiprows=20, skipfooter=2)
cnd.head(2)

- Rename column
- drop column
- add column

In [ ]:
col_to_rename = {
    'odName': 'Country',
    'AreaName': 'Continent',
    'RegName': 'Region',
    'DevName': 'Status'
    }
cnd = cnd.rename(columns=col_to_rename)
cnd.head(2)

In [ ]:
# check no of unique values in data
print("Type unique values:", cnd.Type.unique())
print("coverage Unique values", cnd.Coverage.nunique())

# Count unique vale in a column 
print("coverage unique values count\n", cnd.Coverage)

In [ ]:
cols_to_drop = ['AREA', 'REG', 'DEV', 'Type', 'Coverage']
df = df.drop(columns=cols_to_drop)
df.head(2)